adv = {
    'пытки': "Рассказчик может потребовать бросок Интеллекта, чтобы понять может ли потенциальный палач понять, \
    как использовать это устройство. Подозреваемый объединенный с пыточным устройством автоматически получает\
    урон. Каждый метод или устройство имеет различный рейтинг урона, для определения урона совершается бросок \
    равный рейтингу урона (Трудность 6).  Если подсудимый располагает сведениями или данными, которые он активно \
    пытается скрыть, он должен бросить бросок Силы воли (трудность: 6 + Манипулирование допрашивающего) каждый раз, \
    когда получает урон, чтобы избежать разоблачения этой информации. Как альтернатива, он может потратить пункт Силы воли, \
    чтобы избежать разглашения сведений. За каждый тур пытки допрашивающий бросает Манипулирование + Пытки \
    (сложность Сила воли оппонента). Каждый успех снижает Силу воли подсудимого на один уровень. Как правило, \
    когда подсудимый не имеет запаса Силы воли, он отвечает на любые вопросы. Он может даже сочинить ответы просто, \
    чтобы успокоить палача: признавая ложную вину, называя сообщников в выдуманных преступлениях, в деталях описывать \
    вымышленные грехи. Сложность состоит в том, чтобы подсудимый потерял свою Силу воли, прежде чем пытки убьют его. \
    Квалифицированные палачи способны сделать это. В конце концов, дело мастера боится.",
    'инициатива': "Инициатива определяется броском d10 + ЛОВКОСТЬ + СМЕКАЛКА, первым будет действовать персонаж с \
    наивысшим значением, далее по убыванию. Чтобы ускорить процесс, вместо проверок можно использовать значение инициативы \
    6 + ЛОВКОСТЬ + СМЕКАЛКА. При равенстве значений первенство отдается тому, у кого показатель инициативы выше [ЛОВКОСТЬ + СМЕКАЛКА].",
    'святая земля': "...",
}