# Блоки различных меню
start_btn_list = {'btn1': 'Ссылки', 'btn2': 'Маневры ближнего боя', 'btn3': 'Маневры дистанционного боя',
    'btn4': 'Защитные маневры', 'btn5': 'Общие маневры', 'btn6': 'Различные подсказки', 'btn7': 'Таблицы'}

main_menu = {'btn1': 'Ссылки', 'btn2': 'Маневры ближнего боя', 'btn3': 'Маневры дистанционного боя', 'btn4': 'Защитные маневры', 
        'btn5':'Общие маневры', 'btn6': 'Различные подсказки', 'btn7': 'Таблицы'}

def_maneurs = {'btn1': 'Блок', 'btn2': 'Парирование', 'btn3': 'Уклонение', 'btn4': 'Поглощение урона'}

usual_maneurs = {'btn1': 'Атака с фланга и с тыла', 'btn2': 'Засада', 'btn3': 'Множественные действия', 'btn4': 'Отмена действия', 
        'btn5': 'Перемещение', 'btn6': 'Прицеливание', 'btn7': 'Удар или выстрел вслепую'}

melee_maneurs = {'btn1': 'Бросок', 'btn2': 'Длинное оружие', 'btn3': 'Захват', 'btn4': 'Клинч', 'btn5': 'Подсечка', 
        'btn6': 'Разоружение', 'btn7': 'Удар когтями', 'btn8': 'Удар ногой', 'btn9': 'Удар оружием', 'btn10': 'Удар рукой', 
        'btn11': 'Укус', 'btn12': 'Численное превосходство'}

range_maneurs = {'btn1': 'Беглый огонь', 'btn2': 'Дистанция', 'btn3': 'Длинная очередь', 'btn4': 'Короткая очередь', 'btn5': 'Наведение', 
        'btn6': 'Обстрел', 'btn7': 'Перезарядка', 'btn8': 'Стрельба по-македонски', 'btn9': 'Укрытие'}

tips = {'btn1': 'Пытки', 'btn2': 'Инициатива', 'btn3': 'Святая земля'}

graph_tables = {'btn1': 'Armor', 'btn2': 'Melee weapon', 'btn3': 'Ranged weapon', 'btn4': 'Melee maneurs', 'btn5': 'Ranged maneurs'}

main_btn = 'Главное меню'


# main_menu = {
#         'Ссылки': 'Ссылки', 
#         'Маневры ближнего боя': {'btn1': 'Бросок', 'btn2': 'Длинное оружие', 'btn3': 'Захват', 'btn4': 'Клинч', 'btn5': 'Подсечка', 'btn6': 'Разоружение', 
#         'btn7': 'Удар когтями', 'btn8': 'Удар ногой', 'btn9': 'Удар оружием', 'btn10': 'Удар рукой', 'btn11': 'Укус', 'btn12': 'Численное превосходство'}, 
#         'Маневры дистанционного боя': {'btn1': 'Беглый огонь', 'btn2': 'Дистанция', 'btn3': 'Длинная очередь', 'btn4': 'Короткая очередь', 'btn5': 'Наведение', 
#         'btn6': 'Обстрел', 'btn7': 'Перезарядка', 'btn8': 'Стрельба по-македонски', 'btn9': 'Укрытие'}, 
#         'Защитные маневры': {'btn1': 'Блок', 'btn2': 'Парирование', 'btn3': 'Уклонение', 'btn4': 'Поглощение урона'}, 
#         'Общие маневры': {'btn1': 'Атака с фланга и с тыла', 'btn2': 'Засада', 'btn3': 'Множественные действия', 'btn4': 'Отмена действия', 
#         'btn5': 'Перемещение', 'btn6': 'Прицеливание', 'btn7': 'Удар или выстрел вслепую'}, 
#         'Различные подсказки': {'btn1': 'Пытки', 'btn2': 'Инициатива', 'btn3': 'Святая земля'}, 
#         'Таблицы': {'btn1': 'Armor', 'btn2': 'Melee weapon', 'btn3': 'Ranged weapon', 'btn4': 'Melee maneurs', 'btn5': 'Ranged maneurs'}}